import i18n from 'i18next';
import { initReactI18next } from 'react-i18next';

const resources = {
  ru: {
    main: {
      begin: 'Начать',
      quests: 'Квесты',
      main: 'Главная',
      shop: 'Магазин',
      enter: 'Вход',
      register: 'Регистрация',
      take: 'Забрать',
      begin_quest: 'Начать квест',
      license: 'Лицензия на осуществление деятельности букмекерской конторы №20019733 от 31.12.2020г. (действительна до 17.07.2028г.) выдана РГУ «Комитет индустрии туризма Министерства культуры и спорта Республики Казахстан»'
    },
    banner: {
      title: 'Фармите с Parimatch',
      subtitle: 'Выполняйте квесты, получайте GG-баллы и обменивайте на крутые призы',
      btn: 'Фармить призы'
    },
    rules: {
      title: 'Как это работает',
      connect: 'Подключите аккаунты',
      register: 'Зарегистрируйтесь или войдите в аккаунт Parimatch и добавьте аккаунт Steam',
      quests: 'Выполняйте квесты',
      finish: 'Выполняйте квесты в PM Hero на сайте Parimatch, чтобы получать сундуки с призами. За выполнение заданий, вы также будете получать GG-баллы на сайте PM Pass.',
      chest: 'Открывайте сундуки',
      bonuses: 'В сундуках вас ждут бонусы от Parimatch и другие призы. Чем сложнее квест, тем ценнее лут!',
      store: 'Магазин призов',
      change: 'Копите GG-баллы и меняйте на бонусы и другие крутые призы на сайте PM Pass'
    },
    prizes: {
      title: 'Призы на любой вкус',
      text1: 'PM Hero и PM Pass - это ваш источник бесконечных призов. Получайте награды и GG-баллы за каждый выполненный квест на сайте Parimatch.',
      text2: 'Покупайте на баллы все, что приглянется в магазине PM Pass: скины для CS2, Dota 2, фрибеты, мерч и многое другое. Выбор за вами!'
    },
    quests: {
      text1: 'Выполняйте квесты, делая ставки на спорт или играя в Dota 2 через Steam. Чтобы посмотреть весь список заданий зайдите на сайт Parimatch и найдите раздел PM Hero.',
      text2: 'Квесты обновляются каждый день — фармите призы бесконечно!'
    },
    faq: {
      question1: 'Как связать аккаунты Parimatch и Steam?',
      answer1_text1: 'Убедитесь, что вы выставили настройки приватности в Dota 2 следующим образом, чтобы была открыта ваша история игр.',
      answer1_text2: 'Также вам необходимо быть зарегистрированным клиентом на сайте или в приложении <a class="yellow" href="https://parimatch.kz/" target="_blank">parimatch.kz</a>',
      answer1_text3: 'Если вы не зарегистрированы, перейдите по этой ссылке <a class="yellow" href="https://parimatch.kz/ru/regtel/3" target="_blank">https://parimatch.kz/ru/regtel/3</a> и создайте учетную запись в Parimatch.',
      answer1_text4: 'Далее вам необходимо на этой странице нажать на кнопку “Участвовать”. Введите в форму ваш ID Parimatch и пароль, с которым вы зарегистрировались.',
      answer1_text5: 'Скопировать свой ID можно в разделе “Мой аккаунт” - <a class="yellow" href="https://parimatch.kz/ru/my-account" target="_blank">https://parimatch.kz/ru/my-account</a>',
      question2: 'Зачем привязывать аккаунт Steam?',
      answer2: 'Квесты можно выполнять не только на сайте Parimatch, но и в Dota 2. Если вы привяжете аккаунт Steam, вы сможете наслаждаться любимой игрой и получать за это призы!',
      question3: 'Могу ли я принять участие без аккаунта Steam?',
      answer3_text1: 'Да, вы можете участвовать, выполняя квесты, не связанные с Dota 2. Для этого вам нужен только аккаунт Parimatch.',
      answer3_text2: 'Переходите в раздел геймификации PM Hero и начинайте играть прямо сейчас.',
      question4: 'Как принять участие?',
      answer4_text1: 'Чтобы принять участие:',
      answer4_text2: 'Быть зарегистрированным в Parimatch;',
      answer4_text3: 'Авторизуйтесь;',
      answer4_text4: 'Выполняйте квесты каждый день и получайте гарантированные GG-баллы;',
      answer4_text5: 'Обменивайте GG-баллы на предметы в магазине PM Pass;',
      question5: 'Кто может участвовать?',
      answer5: 'Могут участвовать лица, достигшие 21 года на момент начала акции, являющиеся гражданами Республики Казахстан, проживающие на территории Республики Казахстан и имеющие действительное удостоверение личности гражданина Республики Казахстан.',
      question6: 'Как открыть инвентарь в Стиме для получения предметов?',
      answer6_text1: 'Чтобы получить предметы из Магазина, ваш инвентарь должен быть открыт для видимости.',
      answer6_text2: 'Для этого вы должны:',
      answer6_text3: 'Откройте Стим-клиент;',
      answer6_text4: 'Наведите курсор на свой логин в правом верхнем углу. В выпадающем меню нажмите «Инвентарь»;',
      answer6_text5: 'Нажмите на вкладку «Еще», и выберите «Настройки приватности»;',
      answer6_text6: 'Поставьте галочки напротив слова «Открытый» в рубриках «Статус профиля» и «Инвентарь»;',
      answer6_text7: 'Нажмите «Сохранить изменения».',
    },
    profile: {
      title: 'Профиль',
      info: 'Информация об Аккаунте',
      received_points: 'Получено очков',
      current_balance: 'Текущий баланс'
    }
  },
  kz: {
    main: {
      begin: 'Бастау',
      quests: 'Квесттер',
      main: 'Басты бет',
      shop: 'Дүкен',
      enter: 'Кіру',
      register: 'Тіркелу',
      take: 'Алу',
      begin_quest: 'Квестті бастау',
      license: '"Қазақстан Республикасының Мәдениет және спорт министрлігінің Туризм индустриясының комитеті" РММ берген 31.12.2020ж. №20019733 букмеркерлік кеңсе қызметін жүзеге асыруға лицензия (17.07.2028ж. дейін жарамды)'
    },
    banner: {
      title: 'Parimatch-пен фармдаңыз',
      subtitle: 'Квесттерді орындаңыз, GG-балдарын алыңыз және керемет жүлделерге айырбастаңыз',
      btn: 'Жүлделерді фармдаңыз'
    },
    rules: {
      title: 'Бұл қалай жұмыс істейді',
      connect: 'Аккаунттарды қосыңыз',
      register: 'Тіркеліңіз немесе Parimatch аккаунтына кіріңіз және Steam аккаунтын қосыңыз',
      quests: 'Квесттерді орындаңыз',
      finish: 'Жүлделері бар сандықтарды алу үшін Parimatch сайтында PM Hero-да квесттерді орындаңыз. Тапсырмаларды орындау үшін сіз оған қоса PM Pass сайтында GG-балдарын аласыз.',
      chest: 'Сандықтарды ашыңыз',
      bonuses: 'Сандықтарда сізді Parimatch-тан бонустар және басқа жүлделер күтіп тұр. Квест неғұрлым қиынрақ болса, соғұрлым лут та құндырақ болады!',
      store: 'Жүлделер дүкені',
      change: 'GG-балдарды жинаңыз және PM Pass сайтында бонустарға және басқа керемет жүлделерге айырбастаңыз'
    },
    prizes: {
      title: 'Кез келген талғамға арналған жүлделер',
      text1: 'PM Hero мен PM Pass - бұл шексіз жүлделердің көзі. Parimatch сайтында әр орындалған квест үшін марапттарды және  GG-балдарын алыңыз',
      text2: 'PM Pass дүкенінде ұнағанның барлығын: CS2, Dota 2 үшін скиндер, фрибеттер, мерч және тағы басқаларды балдарға сатып алыңыз. Таңдау өзіңізде!'
    },
    quests: {
      text1: 'Спортқа ұтыстарды тігу немесе Steam арқылы Dota 2 ойнау арқылы квесттерді орындаңыз. Тапсырмалардың толық тізімін көру үшін Parimatch сайтына кіріңіз және PM Hero бөлімін табыңыз.',
      text2: 'Квесттер күн сайын жаңартылып тұрады - жүлделерді шексіз фармдаңыз!'
    },
    faq: {
      question1: 'Parimatch және Steam аккаунттарын қалай байлауға болады?',
      answer1_text1: 'Dota 2-де бейресмилік баптауын сіздің ойындар тарихы ашық болатындай түрде қойғаныңызға көзіңізді жеткізіңіз.',
      answer1_text2: 'Сонымен қатар сіз <a class="yellow" href="https://parimatch.kz/" target="_blank">parimatch.kz</a> сайтында немесе қосымшасында тіркелген клиент болуыңыз қажет. ',
      answer1_text3: 'Егер сіз тіркелмеген болсаңыз, <a class="yellow" href="https://parimatch.kz/ru/regtel/3" target="_blank">https://parimatch.kz/ru/regtel/3</a> сілтемесі бойынша өтіңіз және Parimatch-та тіркеулік жазбасын жасаңыз.',
      answer1_text4: 'Содан кейін сізге осы парақшада "Қатысу" батырмасын басу керек. Үлгіге сіз тіркелгенде пайдаланған өз ID Parimatch-ты және құпия сөзді енгізіңіз.',
      answer1_text5: 'Өз ID-ді "Менің аккаунтым" бөлімінен көшіре аласыз - <a class="yellow" href="https://parimatch.kz/ru/my-account" target="_blank">https://parimatch.kz/ru/my-account</a>',
      question2: 'Не үшін Steam аккаунтын байлау керек?',
      answer2: 'Квесттер тек Parimatch сайтында ғана емес, сонымен қатар Dota 2-де де орындауға болады. Егер сіз Steam, аккаунтын байласаңыз, сіз өз сүйікті ойыныңыздан ләззат атумен қатар, ол үшін жүлделерді де ала аласыз!',
      question3: 'Менде Steam аккаунты жоқ болса, мен қатыса алам ба?',
      answer3_text1: 'Ия, сіз Dota 2-ге қатысы жоқ квесттерді орындау арқылы қатыса аласыз. Ол үшін сізге тек Parimatch аккаунты ғана қажет.',
      answer3_text2: 'PM Hero геймификациясы бөліміне өтіңіз және ойнауды дәл қазір бастаңыз.',
      question4: 'Қалай қатысуға болады?',
      answer4_text1: 'Қатысу үшін:',
      answer4_text2: 'Авторизациядан өтіңіз және парақшаға көшіңіз; ',
      answer4_text3: 'Қатысуды растау үшін "Шақыруды қабылдау" батырманы басыңыз;',
      answer4_text4: 'Күнде квесттерді орындаңыз және жүлделері мен кристалдары бар кепілдендірілген андықтарды алыңыз;',
      answer4_text5: 'Сандықтардағы кристалдарды жинаңыз және ойыншылар рейтингісінде көтеріліңіз; ',
      question5: 'Кім қатыса алады?',
      answer5: 'Акция басталу сәтінде 21 жасқа толған, Қазақстан Республикасының азаматтары болып табылатын, Қазақстан Республикасының аумағында тұратын және Қазақстан Республикасы азаматының жарамды жеке куәлігі бар тұлғалар қатыса алады.',
      question6: 'Заттарды алу үшін Стимде құрал-жабдықтарды қалай ашуға болады?',
      answer6_text1: 'Дүкеннен заттарды алу үшін сіздің құрал-жабдықтарыңыз көрінетіндей ашық болуы тиіс.',
      answer6_text2: 'Ол үшін сізге келесі әрекеттерді жасау керек:',
      answer6_text3: 'Стим-клиентті ашыңыз;',
      answer6_text4: 'Меңзерді жоғарғы оң жақтағы өз логиніңізге апарыңыз. Ашылма мәзірде «Құрал-жабдықтарды» басыңыз;',
      answer6_text5: '«Тағы» қосымша бетін басыңыз және «Бейресмилік баптауын» таңдаңыз;',
      answer6_text6: '«Профиль мәртебесі» және «Құрал-жабдықтар» тарауларында «Ашық» сөзіне қарсы қанат белгісін қойыңыз;',
      answer6_text7: '«Өзгертулерді сақтауды» басыңыз.',
    },
    profile: {
      title: 'Профиль',
      info: 'Аккаунт туралы ақпарат',
      received_points: 'Алынған ұпайлар',
      current_balance: 'Ағымдағы теңгерім'
    }
  }
};

const currentLanguage = localStorage.getItem('language') || 'ru'

i18n
  .use(initReactI18next)
  .init({
    resources,
    lng: currentLanguage,
    fallbackLng: 'ru',
    interpolation: {
      escapeValue: false
    }
  });

export default i18n;
